In [2]:
import pandas as pd

1. Read the data from the CSV file into a DataFrame and display the first five rows

In [3]:
exam_data = pd.read_csv("exams.csv")
exam_data.head(5)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

2. Display the basic information for the DataFrame and its columns using the info() method

In [4]:
exam_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

3. Display statistical information for the math score, reading score, and writing score columns using the
describe() method

In [22]:
exam_data[['math score', 'reading score', "writing score"]].describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

4. Group the data by the race/ethnicity column and display the mean scores.

In [60]:
exam_data['mean score'] = \
    (exam_data['reading score'] + exam_data['math score']  + exam_data['writing score'])/3

exam_data.groupby('race/ethnicity')['mean score'].mean()

race/ethnicity
group A    62.992509
group B    65.468421
group C    67.131661
group D    69.179389
group E    72.752381
Name: mean score, dtype: float64

5. Display a single column as a DataFrame with bracket notation.

In [63]:
exam_data[['lunch']]

            lunch
0        standard
1        standard
2        standard
3    free/reduced
4        standard
..            ...
995      standard
996  free/reduced
997  free/reduced
998      standard
999  free/reduced

[1000 rows x 1 columns]

6. Display a single column as a Series with bracket notation

In [64]:
exam_data['lunch']

0          standard
1          standard
2          standard
3      free/reduced
4          standard
           ...
995        standard
996    free/reduced
997    free/reduced
998        standard
999    free/reduced
Name: lunch, Length: 1000, dtype: object

7. Display a single column as a Series with dot notation.

In [65]:
exam_data.lunch

0          standard
1          standard
2          standard
3      free/reduced
4          standard
           ...
995        standard
996    free/reduced
997    free/reduced
998        standard
999    free/reduced
Name: lunch, Length: 1000, dtype: object

8. Display only rows for females with a math score greater than or equal to 90

In [96]:
exam_data.query("gender=='female' and `math score` >= 90").head(5)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,mean score
2,female,group B,master's degree,standard,none,90,95,93,92.666667
114,female,group E,bachelor's degree,standard,completed,99,100,100,99.666667
165,female,group C,bachelor's degree,standard,completed,96,100,100,98.666667
179,female,group D,some high school,standard,completed,97,100,100,99.000000
263,female,group E,high school,standard,none,99,93,90,94.000000